<script setup>


</script>

<template>
  <view className="font-light font-mono p-4">
    <view>
      <view class="font-bold">
        用户协议（Terms of Service）
      </view>
      <view>
        欢迎使用我们的服务！请在使用之前仔细阅读以下用户协议（以下简称“本协议”）。本协议是您与我们之间关于使用我们提供的服务所订立的协议。通过使用我们的服务，即表示您同意遵守本协议的所有条款和条件。如果您不同意本协议的任何内容，请停止使用我们的服务。<br />
        服务概述 <br />
       <p>1.1 我们的服务是指我们根据本协议提供给您的各种产品和服务。这包括但不限于（列举具体的产品和服务）。</p>
       <p>1.2 使用我们的服务可能需要您访问互联网，可能会产生数据流量费用。您需自行承担相关费用。</p>
        用户责任<br />
       <p>2.1 您在使用我们的服务时需遵守国家法律法规及相关规定，不得使用我们的服务进行非法活动。</p>
       <p>2.2 您应确保您提供的信息真实、准确、完整，并及时更新相关信息。</p>
       <p>2.3 您不得干扰、破坏、侵入我们的服务及相关系统和网络的正常运行。</p>
        知识产权<br />
       <p>3.1 我们的服务包含的所有内容，包括但不限于文字、图片、音频、视频、软件、标识、商标等，均受知识产权法律的保护。</p>
       <p>3.2 未经我们或相关权利人书面许可，您不得以任何方式使用、复制、传播、展示、修改、发布、转让、出售上述内容。</p>
        免责声明<br />
       <p>4.1 我们将尽力保障服务的安全、稳定、及时性和准确性，但不对此提供任何明示或暗示的保证。</p>
       <p>4.2 您理解并同意，使用我们的服务可能存在一定的风险，包括但不限于信息泄露、网络故障、第三方攻击等。您自行承担使用我们服务的风险。</p>
        终止协议<br />
       <p>5.1 如您违反本协议的任何条款，我们有权终止向您提供服务，并保留追究您的法律责任的权利。</p>
       <p>5.2 您可以随时终止协议，停止使用我们的服务。</p>
        其他<br />
       <p>6.1 本协议的解释、适用和争议解决均适用于当地法律法规。</p>
       <p>6.2 如果本协议的任何条款被认定为无效或不可执行，该条款将被视为可分割的，不影响其他条款的有效性和可执行性。</p>
       <p>6.3 本协议构成您与我们之间关于服务的全部协议，取代您先前与我们之间就服务所达成的任何口头或书面协议。</p>
      </view>
    </view>
    <view class="mt-10">
      <view class="font-bold">
        隐私协议（Privacy Policy）
      </view>
      <view>
        欢迎阅读我们的隐私协议（以下简称“本协议”）。本协议旨在向您解释我们如何收集、使用和保护您的个人数据。请在使用我们的服务之前仔细阅读本协议。如果您不同意本协议的内容，请停止使用我们的服务。<br />
        个人数据的收集和使用<br />
       <p>1.1 我们可能会收集您提供的个人数据，包括但不限于（列举具体的个人数据类型）。</p>
       <p>1.2 我们仅会出于以下目的使用您的个人数据：</p>
        为您提供所需的服务；<br />
        处理您的请求和查询；<br />
        改进我们的服务和用户体验；<br />
        向您发送相关通知和更新；<br />
        针对您的个人数据进行内部分析和统计；<br />
        遵守适用的法律法规和监管要求。<br />
        个人数据的保护<br />
       <p>2.1 我们采取合理的安全措施来保护您的个人数据免遭未经授权的访问、使用或泄露。</p>
       <p>2.2 我们仅在必要的情况下将您的个人数据提供给与我们合作的第三方服务提供商，以便他们能够为我们提供相关的服务。</p>
       <p>2.3 我们承诺不会将您的个人数据转让、出售或租赁给任何其他第三方，除非获得您的明确同意或根据法律要求。</p>
       <p>Cookie和类似技术</p>
       <p>3.1 我们的网站和应用程序可能会使用Cookie和类似技术来收集和存储某些信息，以提供更好的用户体验和个性化服务。</p>
       <p>3.2 您可以根据自己的浏览器设置选择接受或拒绝Cookie。如果您选择禁用Cookie，可能会影响您使用我们的服务的某些功能。</p>
        第三方链接<br />
       <p>4.1 我们的服务可能包含指向第三方网站或服务的链接。请注意，本隐私协议仅适用于我们的服务。我们无法控制第三方网站或服务的隐私做法，对于您在访问这些链接时可能提供的个人数据，我们不承担任何责任。</p>
        未成年人的个人数据保护<br />
       <p>5.1 我们的服务仅适用于年满法定年龄的个人。如果您是未成年人，请在法定监护人的指导下使用我们的服务，并确保您的监护人已同意您的个人数据被收集和使用。</p>
        修改和联系方式<br />
       <p>6.1 您有权随时访问、更正、更新或删除我们持有的关于您的个人数据。</p>
       <p>6.2 如对本协议或个人数据的收集和使用有任何问题或疑虑，请通过以下联系方式与我们联系：（提供联系信息）。</p>
        其他<br />
       <p>7.1 我们有权随时修改本隐私协议的内容。修改后的协议将在我们的服务上发布，并在生效前合理通知您。</p>
       <p>7.2 如本隐私协议的任何条款被认定为无效或不可执行，该条款将被视为可分割的，不影响其他条款的有效性和可执行性。</p>
       <p>7.3 本协议构成您与我们之间关于个人数据保护的全部协议，取代您先前与我们之间就个人数据保护所达成的任何口头或书面协议。</p>
      </view>
    </view>
  </view>
</template>

<style>

</style>
